[
  {
    "id": 1,
    "tag": "Ruby",
    "title": "Ruby on Rails Tutorial",
    "descriptoin": "This book is the only Rails book that does test-driven development the entire time, an approach highly recommended by the experts but which has never been so clearly demonstrated before. Finally, by including Git, GitHub, and Heroku in the demo examples, the author really gives you a feel for what it?s like to do a real-world project. The tutorial?s code examples are not in isolation.",
    "author": "Michael Hartl",
    "count": "NA",
    "downId": 8567
  },
  {
    "id": 2,
    "tag": "Ruby",
    "title": "Ruby Programming",
    "descriptoin": "Ruby is an object-oriented scripting language developed by Yukihiro Matsumoto. Topics covered includes: Installing Ruby, Ruby editors, Notation conventions, Interactive Ruby, Data types, Writing methods, Classes and objects, Exceptions, Syntax - Lexicology, Variables and Constants, Control Structures, Classes, Built-In Functions, Predefined Variables, Predefined Classes, Objects , Array, Class, Comparable, Encoding, Enumerable.",
    "author": "Wikipedia .org",
    "count": "NA",
    "downId": 8566
  },
  {
    "id": 3,
    "tag": "Ruby",
    "title": "Mr. Neighborly's Humble Little Ruby Book",
    "descriptoin": "Currently this section contains no detailed description for the page, will update this page soon.",
    "author": "",
    "count": "NA",
    "downId": 8582
  },
  {
    "id": 4,
    "tag": "Ruby",
    "title": "Programming Ruby The Pragmatic Programmers Guide (Dave Thomas) Mirror",
    "descriptoin": "This book is a tutorial and reference for the Ruby programming language. Topics covered includes: Classes, Objects, and Variables, Containers, Blocks, and Iterators, Standard Types , Methods, Expressions, Exceptions, Catch, and Throw, Modules, Basic Input and Output, Threads and Processes, When Trouble Strikes, Ruby and Its World, Ruby and the Web, Ruby Tk, Ruby and Microsoft Windows, Extending Ruby, The Ruby Language, Classes and Objects, Locking Ruby in the Safe, Reflection, ObjectSpace, and Distributed Ruby, Built-in Classes and Methods, Standard Library, Object-Oriented Design Libraries, Network and Web Libraries, Microsoft Windows Support, Embedded Documentation and Interactive Ruby Shell.",
    "author": "NA",
    "count": "NA",
    "downId": 8574
  },
  {
    "id": 5,
    "tag": "Ruby",
    "title": "Ruby and Software Development Lecture Notes",
    "descriptoin": "Covered topics are: Data Abstraction ,Understanding Inheritance, Introductory Ruby, Natural number ADT in Ruby, Background on design patterns, Inverted index program in Ruby, Simple expression recognizer in Ruby, Using Procs and lambdas, Classes and Objects, Domain Modeling.",
    "author": "NA",
    "count": "NA",
    "downId": 8572
  },
  {
    "id": 6,
    "tag": "Ruby",
    "title": "Why's Guide to Ruby",
    "descriptoin": "Currently this section contains no detailed description for the page, will update this page soon.",
    "author": "",
    "count": "NA",
    "downId": 8583
  },
  {
    "id": 7,
    "tag": "Ruby",
    "title": "Ruby Quiz",
    "descriptoin": "Currently this section contains no detailed description for the page, will update this page soon.",
    "author": "",
    "count": "NA",
    "downId": 8581
  },
  {
    "id": 8,
    "tag": "Ruby",
    "title": "Cookin' with Ruby on Rails   Designing for Testability",
    "descriptoin": "This tutorial is intended for use with Rails 1.2.6.It has not yet been updated to support Rails 2.x.",
    "author": "Bill Walton",
    "count": "NA",
    "downId": 8569
  },
  {
    "id": 9,
    "tag": "Ruby",
    "title": "Ruby Programming by Wikibooks.org",
    "descriptoin": "This book is currently broken down into several sections and is intended to be read sequentially. Topics covered includes: Notation conventions, Basic Ruby, Ruby Semantic reference, Built in Classes, Standard Library.",
    "author": "Wikibooks.org",
    "count": "NA",
    "downId": 8564
  },
  {
    "id": 10,
    "tag": "Ruby",
    "title": "Ruby                 in Twenty Minutes",
    "descriptoin": "Currently this section contains no detailed description for the page, will update this page soon.",
    "author": "",
    "count": "NA",
    "downId": 8586
  },
  {
    "id": 11,
    "tag": "Ruby",
    "title": "Programming                 Ruby",
    "descriptoin": "Currently this section contains no detailed description for the page, will update this page soon.",
    "author": "",
    "count": "NA",
    "downId": 8584
  },
  {
    "id": 12,
    "tag": "Ruby",
    "title": "A Little Ruby, A Lot of Objects (Brian Marick)",
    "descriptoin": "The goal of this book is to teach you a way to think about computation, to show you how far you can take a simple idea: that all computationconsists of sending messages to objects. Prerequisites is reader will know at least one programming language, not necessarily.",
    "author": "Brian Marick",
    "count": "NA",
    "downId": 8576
  },
  {
    "id": 13,
    "tag": "Ruby",
    "title": "Learn to Program in Ruby (Chris Pine)",
    "descriptoin": "Currently this section contains no detailed description for the page, will update this page soon.",
    "author": "",
    "count": "NA",
    "downId": 8579
  }
]
