[
  {
    "id": 1,
    "tag": "Scheme",
    "title": "The Scheme Programming Language, 3rd edition (R. Kent Dybvig)(2nd Edition)",
    "descriptoin": "This book is intended to provide an introduction to the Scheme language but not an introduction to programming in general. The reader is expected to have had some experience programming and to be familiar with terms commonly associated with computers and programming languages. Topics covered includes: Variable Binding, Control Operations, Operations on Objects, Input and Output, Syntactic Extension, Extended Examples and Extended Examples.",
    "author": "R. Kent Dybvig",
    "count": "NA",
    "downId": 8591
  },
  {
    "id": 2,
    "tag": "Scheme",
    "title": "Teach Yourself Scheme in Fixnum Days",
    "descriptoin": "This text is an introduction to the Scheme programming language. It is intended as a quick-start guide, something a novice can use to get a non-trivial working knowledge of the language, before moving on to more comprehensive and in-depth texts.",
    "author": "Dorai Sitaram",
    "count": "NA",
    "downId": 8588
  },
  {
    "id": 3,
    "tag": "Scheme",
    "title": "GNU Scheme Reference Manual",
    "descriptoin": "This note covers the following topics: Special Forms, Equivalence Predicates, Numbers, Characters, Strings, Lists, Vectors, Bit Strings, Miscellaneous Datatypes, Associations, Procedures, Environments, Input or Output, Operating-System Interface, Error System and Graphics .",
    "author": "Chris Hanson",
    "count": 366,
    "downId": 8587
  },
  {
    "id": 4,
    "tag": "Scheme",
    "title": "Revised Report on the Algorithmic Language Scheme",
    "descriptoin": "This book gives a defining description of the programming language Scheme. It provides fundamental ideas of the language and describe the notational conventions used for describing the language and for writing programs in the language.",
    "author": "Richard Kelsey, William Clinger and Jonathan Rees",
    "count": "NA",
    "downId": 8589
  },
  {
    "id": 5,
    "tag": "Scheme",
    "title": "An Introduction to Scheme and its Implementation Mirror",
    "descriptoin": "Currently this section contains no detailed description for the page, will update this page soon.",
    "author": "",
    "count": "NA",
    "downId": 8597
  },
  {
    "id": 6,
    "tag": "Scheme",
    "title": "The Scheme Programming Language, 3rd edition (R. Kent Dybvig)",
    "descriptoin": "The Scheme Programming Language, which documents the standard subset of the language. The book offers three chapters of introductory material with numerous examples, eight chapters of reference material, and one chapter of extended examples and additional exercises. All of the examples can be entered directly from the keyboard into an interactive Scheme session.",
    "author": "R. Kent Dybvig",
    "count": "NA",
    "downId": 8590
  },
  {
    "id": 7,
    "tag": "Scheme",
    "title": "How to Use Scheme (by M. Felleisen, et al)",
    "descriptoin": "Currently this section contains no detailed description for the page, will update this page soon.",
    "author": "",
    "count": "NA",
    "downId": 8594
  },
  {
    "id": 8,
    "tag": "Scheme",
    "title": "Concrete Abstractions An Introduction to Computer Science Using Scheme (Ma. Hailperin, et al)",
    "descriptoin": "This book is primarily intended as the text for a first undergraduate course in computer science. It introduce several abstract ideas in as concrete a way as possible. This book is divided into three parts, dealing with procedural abstractions, dataabstractions, and abstractions of state.",
    "author": "Max Hailperin, Barbara Kaiser, and Karl Knight",
    "count": "NA",
    "downId": 8592
  }
]
