[
  {
    "id": 1,
    "tag": "Tcl/Tk",
    "title": "Tcl/Tk Manual",
    "descriptoin": "This note explains all the Tcl and Tk Commands.",
    "author": "International Computer Science Institute",
    "count": "NA",
    "downId": 7610
  },
  {
    "id": 2,
    "tag": "Tcl/Tk",
    "title": "The Linux Tcl and Tk HOWTO (L. Rossetti)",
    "descriptoin": "Currently this section contains no detailed description for the page, will update this page soon.",
    "author": "",
    "count": "NA",
    "downId": 7617
  },
  {
    "id": 3,
    "tag": "Tcl/Tk",
    "title": "Advanced Tcl (PDF 186P)",
    "descriptoin": "This note describes advanced TCL programming techniques that support sophisticated applications.",
    "author": "Yuanzhu Chen",
    "count": 186,
    "downId": 7614
  },
  {
    "id": 4,
    "tag": "Tcl/Tk",
    "title": "Tcl Programming",
    "descriptoin": "Tcl is a scripting language created by John Ousterhout. It can be used interactively, or by running scripts (programs) which can use a package system for structuring, hence allowing to do much with little code. This book discusses the GUI toolkit Tk in considerable extent, even though it's not in the title. For most users, Tcl/Tk form a single conceptual entity.",
    "author": "wikibooks.org",
    "count": "NA",
    "downId": 7607
  },
  {
    "id": 5,
    "tag": "Tcl/Tk",
    "title": "TCLWISE An introduction to the Tcl programming language (S. Sanfilippo)",
    "descriptoin": "Currently this section contains no detailed description for the page, will update this page soon.",
    "author": "",
    "count": "NA",
    "downId": 7615
  },
  {
    "id": 6,
    "tag": "Tcl/Tk",
    "title": "Practical Programming in Tcl and Tk",
    "descriptoin": "Currently this section contains no detailed description for the page, will update this page soon.",
    "author": "",
    "count": "NA",
    "downId": 7616
  },
  {
    "id": 7,
    "tag": "Tcl/Tk",
    "title": "Scripting with Perl and Tcl",
    "descriptoin": "The purpose of this document is to show how the introductory programming examples from the book Python Scripting for Computational Science can be implemented in Perl and Tcl. Topics covered includes: Introduction to Tcl/Tk, A Scientific Hello World Script, Automating Simulation and Visualization, Frequently Encountered Tasks, GUI Programming with Tcl/Tk.",
    "author": "Hans Petter Langtangen",
    "count": 78,
    "downId": 7608
  },
  {
    "id": 8,
    "tag": "Tcl/Tk",
    "title": "Tcl Basics (PDF 118P)",
    "descriptoin": "This note introduces the basics of Tcl. Chapter1 describes the fundamental properties of the language. Chapter 2 is a short introduction to running Tcl and Tk on UNIX, Windows and Macintosh systems. Chapter 3 presents a sample application, a CGI script, that implements a guestbook for a Web site. The rest of this book covers basic programming with Tcl.",
    "author": "Yuanzhu Chen",
    "count": 118,
    "downId": 7613
  },
  {
    "id": 9,
    "tag": "Tcl/Tk",
    "title": "Tcl Tutorial",
    "descriptoin": "The tutorial is intended as a companion to the Tcl manual pages which provide a reference for all Tcl commands.",
    "author": "Clif Flynt",
    "count": "NA",
    "downId": 7609
  },
  {
    "id": 10,
    "tag": "Tcl/Tk",
    "title": "Tcl and the Tk Toolkit (PDF 142P)",
    "descriptoin": "Covered topics are: An Overview of Tcl and Tk, Tcl Language Syntax, Variables, Expressions, Lists, Control Flow, Procedures, Errors and Exceptions, String Manipulation, Accessing Files, Processes, Managing Tcl Internals.",
    "author": "John K. Ousterhout",
    "count": 142,
    "downId": 7612
  }
]
